import os
import random
import time


def animation_weather(dict_data_weather):
    arts = {
        'Overcast': (
            """
          .--.
       .-(    ). 
      (___.__)__)
            """,
            """
          .--._..
       _..(   - _)
      (___.__)__)
            """,
            """
            __.---.
        _.-(     ). 
      (___.__)__)._
            """
        ),

        'Partly Cloudy': (
            """
        \  /       
      _ /"".-.     
        \_(   ).   
        /(___(__)  
            """,
            """
        \  /       
      _ /""\.-.     
        \__/(   ).   
        /(__(__)  
            """,
            """
        \  /       
     .-./""\     
    (   ). / 
    (__(__)\  
            """
        ),

        'Clear': (
            """
        \   /       
         .-.      
      ― (   ) ―   
         `-’             
        /   \    
            """,
            """
        \   /       
         .-.      
      ― ( ° ) ―   
         `-’             
        /   \    
            """,
            """
        \   /       
         .-.      
      ― (   ) ―   
         `-’             
        /   \    
            """
        ),

        'Moderate snow': (
            """
      .-.      
     (   ).   *
    (___(__)  
    *   *   *  
      *   *   * 
            """,
            """
        *         
     * (   ). *
     (___(__)  
    *   *   *
      *   *   *
            """,
            """
        *  .-.   * 
      * (   ).   
       (___(__) *
       *   *   *  
         *   *   
            """
        ),

        'Sunny': (
            """
      \   /       
       .-.      
    ― (   ) ―   
       `-’             
      /   \    
            """,
            """
        \   /       
         .-.      
      ― ( ° ) ―   
         `-’             
        /   \    
            """,
            """
        \   /       
         .-.      
      ― (   ) ―   
         `-’             
        /   \    
            """
        ),

        'Rain': (
            """
         .-.      
        (   ).    
       (___(__)   
      ‚ʻ‚ʻ‚ʻ‚ʻ   
       ʻ‚ʻ‚ʻ‚ʻ‚  
            """,
            """
         .-.      
        (   ). ‚  
       (___(__)   
     ‚ʻ‚ʻ‚ʻ‚ʻ‚
      ʻ‚ʻ‚ʻ‚ʻ‚  
            """,
            """
         .-.    ʻ 
        (   ).    
       (___(__) ‚ 
      ‚ʻ‚ʻ‚ʻ‚ʻ
       ʻ‚ʻ‚ʻ‚ʻ‚  
            """
        ),

        'Light rain': (
            """
         .-.      
        (   ).    
       (___(__)   
        ʻ  ʻ  ʻ   
            """,
            """
         .-.      
        (   ). ʻ  
       (___(__)   
      ʻ  ʻ  ʻ  
            """,
            """
         .-.      
        (   ).    
       (___(__) ʻ 
        ʻ  ʻ  ʻ   
            """
        ),

        'Thunderstorm': (
            """
         .-.      
        (   ). ⚡  
       (___(__)   
      ‚ʻ‚ʻ‚ʻ‚ʻ   
            """,
            """
         .-.    ⚡ 
        (   ).    
       (___(__)   
      ‚ʻ‚ʻ‚ʻ‚ʻ   
            """,
            """
         .-.      
        (   ).    
       (___(__)   
      ‚ʻ‚ʻ⚡‚ʻ   
            """
        ),

        'Fog': (
            """
       _ - _ - _  
      _ - _ - _ - 
       _ - _ - _  
            """,
            """
      _ - _ - _ - 
       _ - _ - _  
      _ - _ - _ - 
            """,
            """
       _ - _ - _  
      _ - _ - _ - 
       _ - _ - _  
            """
        )
    }

    print(dict_data_weather['sky'])

    info_weather = f"""
🌤️  Погода: {dict_data_weather['sky']}
🌡️  Температура: {dict_data_weather['degrees']}
💨 Ветер: {dict_data_weather['wind_speed']}
👀 Видимость: {dict_data_weather['visibility']}
💧 Осадки: {dict_data_weather['precipitation']}
    """
    list_arts = arts[dict_data_weather['sky']]

    for i in range(20):
        os.system('clear')

        print('='*20)
        current_arts = random.choice(list_arts)
        print(' '*10,current_arts)
        print('=' * 20)

        print(' '*10,info_weather)

        time.sleep(0.4)


if __name__ == '__main__':
    d = {'sky': 'Rain', 'degrees': '+3(2) °C', 'wind_speed': '← 6 km/h',
         'precipitation': '0.0 mm', 'visibility': '10 km'}
    animation_weather(d)
